Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
images (InputLayer)             [(None, 1024, 128, 1 0                                            
__________________________________________________________________________________________________
encoder_flor_v3 (EncoderFlorV3) (None, 128, 512)     1205600     images[0][0]                     
__________________________________________________________________________________________________
decoder_baseline (DecoderBaseli (None, 128, 256)     789504      encoder_flor_v3[0][0]            
__________________________________________________________________________________________________
the_labels (InputLayer)         [(None, None)]       0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 128, 68)      17476       decoder_baseline[0][0]           
__________________________________________________________________________________________________
input_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
label_length (InputLayer)       [(None, 1)]          0                                            
__________________________________________________________________________________________________
ctc (Lambda)                    (None, 1)            0           the_labels[0][0]                 
                                                                 dense[0][0]                      
                                                                 input_length[0][0]               
                                                                 label_length[0][0]               
==================================================================================================
Total params: 2,012,580
Trainable params: 17,476
Non-trainable params: 1,995,104
__________________________________________________________________________________________________
