Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
char_ids (InputLayer)           [(None, None)]       0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, None, 256)    24064       char_ids[0][0]                   
__________________________________________________________________________________________________
dense (Dense)                   (None, None, 128)    32896       embedding[0][0]                  
__________________________________________________________________________________________________
bi_rnn_layer_v2 (BiRNNLayerV2)  (None, None, 256)    792576      dense[0][0]                      
                                                                 char_ids[0][0]                   
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, None, 94)     24158       bi_rnn_layer_v2[0][0]            
==================================================================================================
Total params: 873,694
Trainable params: 873,694
Non-trainable params: 0
__________________________________________________________________________________________________
