Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
char_ids (InputLayer)        [(None, None)]            0         
_________________________________________________________________
transformer_model (Transform (None, None, 128)         1265408   
_________________________________________________________________
dense_12 (Dense)             (None, None, 94)          12126     
=================================================================
Total params: 1,277,534
Trainable params: 1,277,534
Non-trainable params: 0
_________________________________________________________________
